pok3r-custom/pok3r_re_firmware/vendor/holtek/HT32_STD_5xxxx_FWLib_v011_4188/example/I2S/CodecLoopback_PDMA/wm8978.h
/*********************************************************************************************************//**
 * @file    I2S/CodecLoopback_PDMA/wm8978.h
 * @version $Rev:: 577          $
 * @date    $Date:: 2016-05-19 #$
 * @brief   The header file of wm8978 driver.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Define to prevent recursive inclusion -------------------------------------------------------------------*/
#ifndef __WM8978_H
#define __WM8978_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32.h"

#define WM8978_I2S  I2S_PORT(WM8978_I2S_CH)

/* 7-bit 2-wire device address                                                                              */
#define WM8978_ID                       (0x1A)

/* Register Definitions                                                                                     */
#define REG_SOFTWARE_RESET              ((u16)0)
#define REG_POWER_MANAGEMENT1           ((u16)(1 << 9))
#define REG_POWER_MANAGEMENT2           ((u16)(2 << 9))
#define REG_POWER_MANAGEMENT3           ((u16)(3 << 9))
#define REG_AUDIO_INTERFACE             ((u16)(4 << 9))
#define REG_COMPANDING                  ((u16)(5 << 9))
#define REG_CLOCK_GEN                   ((u16)(6 << 9))
#define REG_ADDITIONAL                  ((u16)(7 << 9))
#define REG_GPIO                        ((u16)(8 << 9))
#define REG_JACK_DETECT1                ((u16)(9 << 9))
#define REG_DAC                         ((u16)(10 << 9))
#define REG_LEFT_DAC_VOL                ((u16)(11 << 9))
#define REG_RIGHT_DAC_VOL               ((u16)(12 << 9))
#define REG_JACK_DETECT2                ((u16)(13 << 9))
#define REG_ADC                         ((u16)(14 << 9))
#define REG_LEFT_ADC_VOL                ((u16)(15 << 9))
#define REG_RIGHT_ADC_VOL               ((u16)(16 << 9))
#define REG_EQ1                         ((u16)(18 << 9))
#define REG_EQ2                         ((u16)(19 << 9))
#define REG_EQ3                         ((u16)(20 << 9))
#define REG_EQ4                         ((u16)(21 << 9))
#define REG_EQ5                         ((u16)(22 << 9))
#define REG_DAC_LIMITER1                ((u16)(24 << 9))
#define REG_DAC_LIMITER2                ((u16)(25 << 9))
#define REG_NOTCH_FILTER1               ((u16)(27 << 9))
#define REG_NOTCH_FILTER2               ((u16)(28 << 9))
#define REG_NOTCH_FILTER3               ((u16)(29 << 9))
#define REG_NOTCH_FILTER4               ((u16)(30 << 9))
#define REG_ALC1                        ((u16)(32 << 9))
#define REG_ALC2                        ((u16)(33 << 9))
#define REG_ALC3                        ((u16)(34 << 9))
#define REG_NOISE_GATE                  ((u16)(35 << 9))
#define REG_PLL_N                       ((u16)(36 << 9))
#define REG_PLL_K1                      ((u16)(37 << 9))
#define REG_PLL_K2                      ((u16)(38 << 9))
#define REG_PLL_K3                      ((u16)(39 << 9))
#define REG_3D                          ((u16)(41 << 9))
#define REG_BEEP                        ((u16)(43 << 9))
#define REG_INPUT                       ((u16)(44 << 9))
#define REG_LEFT_PGA_GAIN               ((u16)(45 << 9))
#define REG_RIGHT_PGA_GAIN              ((u16)(46 << 9))
#define REG_LEFT_ADC_BOOST              ((u16)(47 << 9))
#define REG_RIGHT_ADC_BOOST             ((u16)(48 << 9))
#define REG_OUTPUT                      ((u16)(49 << 9))
#define REG_LEFT_MIXER                  ((u16)(50 << 9))
#define REG_RIGHT_MIXER                 ((u16)(51 << 9))
#define REG_LOUT1_VOL                   ((u16)(52 << 9))
#define REG_ROUT1_VOL                   ((u16)(53 << 9))
#define REG_LOUT2_VOL                   ((u16)(54 << 9))
#define REG_ROUT2_VOL                   ((u16)(55 << 9))
#define REG_OUT3_MIXER                  ((u16)(56 << 9))
#define REG_OUT4_MIXER                  ((u16)(57 << 9))

// R01 REG_POWER_MANAGEMENT1
#define BUFDCOPEN                       (1 << 8)
#define OUT4MIXEN                       (1 << 7)
#define OUT3MIXEN                       (1 << 6)
#define PLLEN                           (1 << 5)
#define MICBEN                          (1 << 4)
#define BIASEN                          (1 << 3)
#define BUFIOEN                         (1 << 2)
#define VMIDSEL_OFF                     (0)
#define VMIDSEL_75K                     (1)
#define VMIDSEL_300K                    (2)
#define VMIDSEL_5K                      (3)

// R02 REG_POWER_MANAGEMENT2
#define ROUT1EN                         (1 << 8)
#define LOUT1EN                         (1 << 7)
#define SLEEP                           (1 << 6)
#define BOOSTENR                        (1 << 5)
#define BOOSTENL                        (1 << 4)
#define INPPGAENR                       (1 << 3)
#define INPPGAENL                       (1 << 2)
#define ADCENR                          (1 << 1)
#define ADCENL                          (1)

// R03 REG_POWER_MANAGEMENT3
#define OUT4EN                          (1 << 8)
#define OUT3EN                          (1 << 7)
#define LOUT2EN                         (1 << 6)
#define ROUT2EN                         (1 << 5)
#define RMIXEN                          (1 << 3)
#define LMIXEN                          (1 << 2)
#define DACENR                          (1 << 1)
#define DACENL                          (1)

// R04 REG_AUDIO_INTERFACE
#define BCP_NORMAL                      (0)
#define BCP_INVERTED                    (1 << 8)
#define LRP_NORMAL                      (0)
#define LRP_INVERTED                    (1 << 7)
#define WL_16BITS                       (0)
#define WL_20BITS                       (1 << 5)
#define WL_24BITS                       (2 << 5)        // Default value
#define WL_32BITS                       (3 << 5)
#define FMT_RIGHT_JUSTIFIED             (0)
#define FMT_LEFT_JUSTIFIED              (1 << 3)
#define FMT_I2S                         (2 << 3)        // Default value
#define FMT_PCM                         (3 << 3)
#define DACLRSWAP                       (1 << 2)
#define ADCLRSWAP                       (1 << 1)
#define MONO                            (1)

// R05 REG_COMPANDING
#define WL8                             (1 << 5)
#define DAC_COMP_OFF                    (0)             // Default value
#define DAC_COMP_ULAW                   (2 << 3)
#define DAC_COMP_ALAW                   (3 << 3)
#define ADC_COMP_OFF                    (0)             // Default value
#define ADC_COMP_ULAW                   (2 << 1)
#define ADC_COMP_ALAW                   (3 << 1)
#define LOOPBACK                        (1)

