pok3r-custom/pok3r_re_firmware/vendor/holtek/HT32_STD_5xxxx_FWLib_v011_4188/example/I2S/CodecLoopback_PDMA/wm8978.h
// R06 REG_CLOCK_GEN
#define CLKSEL_MCLK                     (0)
#define CLKSEL_PLL                      (1 << 8)        // Default value
#define MCLK_DIV1                       (0)
#define MCLK_DIV1_5                     (1 << 5)
#define MCLK_DIV2                       (2 << 5)        // Default value
#define MCLK_DIV3                       (3 << 5)
#define MCLK_DIV4                       (4 << 5)
#define MCLK_DIV6                       (5 << 5)
#define MCLK_DIV8                       (6 << 5)
#define MCLK_DIV12                      (7 << 5)
#define BCLK_DIV1                       (0)             // Default value
#define BCLK_DIV2                       (1 << 2)
#define BCLK_DIV4                       (2 << 2)
#define BCLK_DIV8                       (3 << 2)
#define BCLK_DIV16                      (4 << 2)
#define BCLK_DIV32                      (5 << 2)
#define MS                              (1)

// R07 REG_ADDITIONAL
#define SR_48KHZ                        (0)             // Default value
#define SR_32KHZ                        (1 << 1)
#define SR_24KHZ                        (2 << 1)
#define SR_16KHZ                        (3 << 1)
#define SR_12KHZ                        (4 << 1)
#define SR_8KHZ                         (5 << 1)
#define SLOWCLKEN                       (1)

// R08 REG_GPIO
#define OPCLK_DIV1                      (0)             // Default value
#define OPCLK_DIV2                      (1 << 4)
#define OPCLK_DIV3                      (2 << 4)
#define OPCLK_DIV4                      (3 << 4)
#define GPIO1POL_NONINVERTED            (0)             // Default value
#define GPIO1POL_INVERTED               (1 << 3)
#define GPIO1SEL_INPUT                  (0)             // Default value
#define GPIO1SEL_TEMP_OK                (2)
#define GPIO1SEL_AMUTE_ACTIVE           (3)
#define GPIO1SEL_PLL_CLK_OP             (4)
#define GPIO1SEL_PLL_LOCK               (5)
#define GPIO1SEL_LOGIC0                 (6)
#define GPIO1SEL_LOGIC1                 (7)

// R09 REG_JACK_DETECT1
#define JD_VMID_EN1                     (1 << 8)
#define JD_VMID_EN0                     (1 << 7)
#define JD_EN                           (1 << 6)
#define JD_SEL_GPIO1                    (0 << 4)        // Default value
#define JD_SEL_GPIO2                    (1 << 4)
#define JD_SEL_GPIO3                    (2 << 4)

// R10 REG_DAC
#define SOFTMUTE                        (1 << 6)
#define DACOSR128                       (1 << 3)
#define AMUTE                           (1 << 2)
#define DACPOLR                         (1 << 1)
#define DACPOLL                         (1)

// R11 & R12 REG_LEFT_DAC_VOL & REG_RIGHT_DAC_VOL
#define DACVU                           (1 << 8)
#define DACVOL_POS                      (0)
#define DACVOL_MASK                     (0xFF)

// R13 REG_JACK_DETECT2
#define JD_OUT4_EN1                     (1 << 7)
#define JD_OUT3_EN1                     (1 << 6)
#define JD_OUT2_EN1                     (1 << 5)
#define JD_OUT1_EN1                     (1 << 4)
#define JD_OUT4_EN0                     (1 << 3)
#define JD_OUT3_EN0                     (1 << 2)
#define JD_OUT2_EN0                     (1 << 1)
#define JD_OUT1_EN0                     (1)

// R14 REG_ADC
#define HPFEN                           (1 << 8)
#define HPFAPP                          (1 << 7)
#define HPFCUT_POS                      (4)
#define HPFCUT_MASK                     (7)
#define HPFCUT_0                        (0)
#define HPFCUT_1                        (1 << 4)
#define HPFCUT_2                        (2 << 4)
#define HPFCUT_3                        (3 << 4)
#define HPFCUT_4                        (4 << 4)
#define HPFCUT_5                        (5 << 4)
#define HPFCUT_6                        (6 << 4)
#define HPFCUT_7                        (7 << 4)
#define ADCOSR128                       (1 << 3)
#define ADCRPOL                         (1 << 1)
#define ADCLPOL                         (1)

// R15 & R16 REG_LEFT_ADC_VOL & REG_RIGHT_ADC_VOL
#define ADCVU                           (1 << 8)
#define ADCVOL_POS                      (0)
#define ADCVOL_MASK                     (0xFF)

// R18 REG_EQ1
#define EQ3DMODE_ADC                    (0)
#define EQ3DMODE_DAC                    (1 << 8)        // Default value
#define EQ1C_80HZ                       (0)
#define EQ1C_105HZ                      (1 << 5)        // Default value
#define EQ1C_135HZ                      (2 << 5)
#define EQ1C_175HZ                      (3 << 5)

// R19 REG_EQ2
#define EQ2BW_NARROW                    (0)             // Default value
#define EQ2BW_WIDE                      (1 << 8)
#define EQ2C_230HZ                      (0)
#define EQ2C_300HZ                      (1 << 5)        // Default value
#define EQ2C_385HZ                      (2 << 5)
#define EQ2C_500HZ                      (3 << 5)

// R20 REG_EQ3
#define EQ3BW_NARROW                    (0)             // Default value
#define EQ3BW_WIDE                      (1 << 8)
#define EQ3C_650HZ                      (0)
#define EQ3C_850HZ                      (1 << 5)        // Default value
#define EQ3C_1_1KHZ                     (2 << 5)
#define EQ3C_1_4KHZ                     (3 << 5)

// R21 REG_EQ4
#define EQ4BW_NARROW                    (0)             // Default value
#define EQ4BW_WIDE                      (1 << 8)
#define EQ4C_1_8KHZ                     (0)
#define EQ4C_2_4KHZ                     (1 << 5)        // Default value
#define EQ4C_3_2KHZ                     (2 << 5)
#define EQ4C_4_1KHZ                     (3 << 5)

// R22 REG_EQ5
#define EQ5C_5_3KHZ                     (0)
#define EQ5C_6_9KHZ                     (1 << 5)        // Default value
#define EQ5C_9KHZ                       (2 << 5)
#define EQ5C_11_7KHZ                    (3 << 5)

// R18 - R22
#define EQC_POS                         (5)
#define EQC_MASK                        (3)
#define EQG_POS                         (0)
#define EQG_MASK                        (31)

// R24 REG_DAC_LIMITER1
#define LIMEN                           (1 << 8)
#define LIMDCY_POS                      (4)
#define LIMDCY_MASK                     (15)
#define LIMDCY_750US                    (0)
#define LIMDCY_1_5MS                    (1 << 4)
#define LIMDCY_3MS                      (2 << 4)
#define LIMDCY_6MS                      (3 << 4)        // Default value
#define LIMDCY_12MS                     (4 << 4)
#define LIMDCY_24MS                     (5 << 4)
#define LIMDCY_48MS                     (6 << 4)
#define LIMDCY_96MS                     (7 << 4)
#define LIMDCY_192MS                    (8 << 4)
#define LIMDCY_384MS                    (9 << 4)
#define LIMDCY_768MS                    (10 << 4)
#define LIMATK_POS                      (0)
#define LIMATK_MASK                     (15)
#define LIMATK_94US                     (0)
#define LIMATK_188US                    (1)
#define LIMATK_375US                    (2)             // Default value
#define LIMATK_750US                    (3)
#define LIMATK_1_5MS                    (4)
#define LIMATK_3MS                      (5)
#define LIMATK_6MS                      (6)
#define LIMATK_12MS                     (7)
#define LIMATK_24MS                     (8)
#define LIMATK_48MS                     (9)
#define LIMATK_96MS                     (10)
#define LIMATK_192MS                    (11)

