pok3r-custom/pok3r_re_firmware/vendor/holtek/HT32_STD_5xxxx_FWLib_v011_4188/example/I2S/CodecLoopback_PDMA/wm8978.h
// R25 REG_DAC_LIMITER2
#define LIMLVL_POS                      (4)
#define LIMLVL_MASK                     (7)
#define LIMLVL_N1DB                     (0)             // Default value
#define LIMLVL_N2DB                     (1 << 4)
#define LIMLVL_N3DB                     (2 << 4)
#define LIMLVL_N4DB                     (3 << 4)
#define LIMLVL_N5DB                     (4 << 4)
#define LIMLVL_N6DB                     (5 << 4)
#define LIMBOOST_POS                    (0)
#define LIMBOOST_MASK                   (15)
#define LIMBOOST_0DB                    (0)
#define LIMBOOST_1DB                    (1)
#define LIMBOOST_2DB                    (2)
#define LIMBOOST_3DB                    (3)
#define LIMBOOST_4DB                    (4)
#define LIMBOOST_5DB                    (5)
#define LIMBOOST_6DB                    (6)
#define LIMBOOST_7DB                    (7)
#define LIMBOOST_8DB                    (8)
#define LIMBOOST_9DB                    (9)
#define LIMBOOST_10DB                   (10)
#define LIMBOOST_11DB                   (11)
#define LIMBOOST_12DB                   (12)

// R27 - R30 REG_NOTCH_FILTER1 - REG_NOTCH_FILTER4
#define NFU                             (1 << 8)
#define NFEN                            (1 << 7)
#define NFA_POS                         (0)
#define NFA_MASK                        (127)

// R32 REG_ALC1
#define ALCSEL_OFF                      (0)             // Default value
#define ALCSEL_RIGHT_ONLY               (1 << 7)
#define ALCSEL_LEFT_ONLY                (2 << 7)
#define ALCSEL_BOTH_ON                  (3 << 7)
#define ALCMAXGAIN_POS                  (3)
#define ALCMAXGAIN_MASK                 (7)
#define ALCMAXGAIN_N6_75DB              (0)
#define ALCMAXGAIN_N0_75DB              (1 << 3)
#define ALCMAXGAIN_5_25DB               (2 << 3)
#define ALCMAXGAIN_11_25DB              (3 << 3)
#define ALCMAXGAIN_17_25DB              (4 << 3)
#define ALCMAXGAIN_23_25DB              (5 << 3)
#define ALCMAXGAIN_29_25DB              (6 << 3)
#define ALCMAXGAIN_35_25DB              (7 << 3)        // Default value
#define ALCMINGAIN_POS                  (0)
#define ALCMINGAIN_MASK                 (7)
#define ALCMINGAIN_N12DB                (0)             // Default value
#define ALCMINGAIN_N6DB                 (1)
#define ALCMINGAIN_0DB                  (2)
#define ALCMINGAIN_6DB                  (3)
#define ALCMINGAIN_12DB                 (4)
#define ALCMINGAIN_18DB                 (5)
#define ALCMINGAIN_24DB                 (6)
#define ALCMINGAIN_30DB                 (7)

// R33 REG_ALC2
#define ALCHLD_POS                      (4)
#define ALCHLD_MASK                     (15)
#define ALCHLD_0MS                      (0)             // Default value
#define ALCHLD_2_67MS                   (1 << 4)
#define ALCHLD_5_33MS                   (2 << 4)
#define ALCHLD_10_67MS                  (3 << 4)
#define ALCHLD_21_33MS                  (4 << 4)
#define ALCHLD_42_67MS                  (5 << 4)
#define ALCHLD_85_33MS                  (6 << 4)
#define ALCHLD_170_67MS                 (7 << 4)
#define ALCHLD_341_33MS                 (8 << 4)
#define ALCHLD_682_67MS                 (9 << 4)
#define ALCHLD_1_36S                    (10 << 4)
#define ALCLVL_POS                      (0)
#define ALCLVL_MASK                     (15)
#define ALCLVL_N22_5DBFS                (0)
#define ALCLVL_N21DBFS                  (1)
#define ALCLVL_N19_5DBFS                (2)
#define ALCLVL_N18DBFS                  (3)
#define ALCLVL_N16_5DBFS                (4)
#define ALCLVL_N15DBFS                  (5)
#define ALCLVL_N13_5DBFS                (6)
#define ALCLVL_N12DBFS                  (7)
#define ALCLVL_N10_5DBFS                (8)
#define ALCLVL_N9DBFS                   (9)
#define ALCLVL_N7_5DBFS                 (10)
#define ALCLVL_N6DBFS                   (11)            // Default value
#define ALCLVL_N4_5DBFS                 (12)
#define ALCLVL_N3DBFS                   (13)
#define ALCLVL_N1_5DBFS                 (14)

// R34 REG_ALC3
#define ALCMODE_ALC                     (0)             // Default value
#define ALCMODE_LIMITER                 (1 << 8)
#define ALCDCY_POS                      (4)
#define ALCDCY_MASK                     (15)
#define ALCDCY_0                        (0)
#define ALCDCY_1                        (1 << 4)
#define ALCDCY_2                        (2 << 4)
#define ALCDCY_3                        (3 << 4)        // Default value
#define ALCDCY_4                        (4 << 4)
#define ALCDCY_5                        (5 << 4)
#define ALCDCY_6                        (6 << 4)
#define ALCDCY_7                        (7 << 4)
#define ALCDCY_8                        (8 << 4)
#define ALCDCY_9                        (9 << 4)
#define ALCDCY_10                       (10 << 4)
#define ALCATK_POS                      (0)
#define ALCATK_MASK                     (15)
#define ALCATK_0                        (0)
#define ALCATK_1                        (1)
#define ALCATK_2                        (2)             // Default value
#define ALCATK_3                        (3)
#define ALCATK_4                        (4)
#define ALCATK_5                        (5)
#define ALCATK_6                        (6)
#define ALCATK_7                        (7)
#define ALCATK_8                        (8)
#define ALCATK_9                        (9)
#define ALCATK_10                       (10)

// R35 REG_NOISE_GATE
#define NGEN                            (1 << 3)
#define NGTH_POS                        (0)
#define NGTH_MASK                       (7)
#define NGTH_N39DB                      (0)             // Default value
#define NGTH_N45DB                      (1)
#define NGTH_N51DB                      (2)
#define NGTH_N57DB                      (3)
#define NGTH_N63DB                      (4)
#define NGTH_N69DB                      (5)
#define NGTH_N75DB                      (6)
#define NGTH_N81DB                      (7)

// R36 REG_PLL_N
#define PLLPRESCALE                     (1 << 4)
#define PLLN_POS                        (0)
#define PLLN_MASK                       (15)

