pok3r-custom/pok3r_re_firmware/vendor/holtek/HT32_STD_5xxxx_FWLib_v011_4188/example/I2S/CodecLoopback_PDMA/wm8978.h
// R37 - R39 REG_PLL_K1 - REG_PLL_K3
#define PLLK1_POS                       (0)
#define PLLK1_MASK                      (63)
#define PLLK2_POS                       (0)
#define PLLK2_MASK                      (511)
#define PLLK3_POS                       (0)
#define PLLK3_MASK                      (511)

// R41 REG_3D
#define DEPTH3D_POS                     (0)
#define DEPTH3D_MASK                    (15)
#define DEPTH3D_0                       (0)             // Default value
#define DEPTH3D_6_67                    (1)
#define DEPTH3D_13_33                   (2)
#define DEPTH3D_20                      (3)
#define DEPTH3D_26_67                   (4)
#define DEPTH3D_33_33                   (5)
#define DEPTH3D_40                      (6)
#define DEPTH3D_46_67                   (7)
#define DEPTH3D_53_33                   (8)
#define DEPTH3D_60                      (9)
#define DEPTH3D_66_67                   (10)
#define DEPTH3D_73_33                   (11)
#define DEPTH3D_80                      (12)
#define DEPTH3D_86_67                   (13)
#define DEPTH3D_93_33                   (14)
#define DEPTH3D_100                     (15)

// R43 REG_BEEP
#define MUTERPGA2INV                    (1 << 5)
#define INVROUT2                        (1 << 4)
#define BEEPVOL_POS                     (1)
#define BEEPVOL_MASK                    (7)
#define BEEPVOL_N15DB                   (0)
#define BEEPVOL_N12DB                   (1 << 1)
#define BEEPVOL_N9DB                    (2 << 1)
#define BEEPVOL_N6DB                    (3 << 1)
#define BEEPVOL_N3DB                    (4 << 1)
#define BEEPVOL_0DB                     (5 << 1)
#define BEEPVOL_3DB                     (6 << 1)
#define BEEPVOL_6DB                     (7 << 1)
#define BEEPEN                          (1)

// R44 REG_INPUT
#define MBVSEL_0_9AVDD                  (0)             // Default value
#define MBVSEL_0_65AVDD                 (1 << 8)
#define R2_2INPVGA                      (1 << 6)
#define RIN2INPVGA                      (1 << 5)        // Default value
#define RIP2INPVGA                      (1 << 4)        // Default value
#define L2_2INPVGA                      (1 << 2)
#define LIN2INPVGA                      (1 << 1)        // Default value
#define LIP2INPVGA                      (1)             // Default value

// R45 REG_LEFT_PGA_GAIN
#define INPPGAUPDATE                    (1 << 8)
#define INPPGAZCL                       (1 << 7)
#define INPPGAMUTEL                     (1 << 6)

// R46 REG_RIGHT_PGA_GAIN
#define INPPGAZCR                       (1 << 7)
#define INPPGAMUTER                     (1 << 6)

// R45 - R46
#define INPPGAVOL_POS                   (0)
#define INPPGAVOL_MASK                  (63)

// R47 REG_LEFT_ADC_BOOST
#define PGABOOSTL                       (1 << 8)        // Default value
#define L2_2BOOSTVOL_POS                (4)
#define L2_2BOOSTVOL_MASK               (7)
#define L2_2BOOSTVOL_DISABLED           (0)             // Default value
#define L2_2BOOSTVOL_N12DB              (1 << 4)
#define L2_2BOOSTVOL_N9DB               (2 << 4)
#define L2_2BOOSTVOL_N6DB               (3 << 4)
#define L2_2BOOSTVOL_N3DB               (4 << 4)
#define L2_2BOOSTVOL_0DB                (5 << 4)
#define L2_2BOOSTVOL_3DB                (6 << 4)
#define L2_2BOOSTVOL_6DB                (7 << 4)
#define AUXL2BOOSTVOL_POS               (0)
#define AUXL2BOOSTVOL_MASK              (7)
#define AUXL2BOOSTVOL_DISABLED          (0)             // Default value
#define AUXL2BOOSTVOL_N12DB             (1)
#define AUXL2BOOSTVOL_N9DB              (2)
#define AUXL2BOOSTVOL_N6DB              (3)
#define AUXL2BOOSTVOL_N3DB              (4)
#define AUXL2BOOSTVOL_0DB               (5)
#define AUXL2BOOSTVOL_3DB               (6)
#define AUXL2BOOSTVOL_6DB               (7)

// R48 REG_RIGHT_ADC_BOOST
#define PGABOOSTR                       (1 << 8)        // Default value
#define R2_2BOOSTVOL_POS                (4)
#define R2_2BOOSTVOL_MASK               (7)
#define R2_2BOOSTVOL_DISABLED           (0)             // Default value
#define R2_2BOOSTVOL_N12DB              (1 << 4)
#define R2_2BOOSTVOL_N9DB               (2 << 4)
#define R2_2BOOSTVOL_N6DB               (3 << 4)
#define R2_2BOOSTVOL_N3DB               (4 << 4)
#define R2_2BOOSTVOL_0DB                (5 << 4)
#define R2_2BOOSTVOL_3DB                (6 << 4)
#define R2_2BOOSTVOL_6DB                (7 << 4)
#define AUXR2BOOSTVOL_POS               (0)
#define AUXR2BOOSTVOL_MASK              (7)
#define AUXR2BOOSTVOL_DISABLED          (0)             // Default value
#define AUXR2BOOSTVOL_N12DB             (1)
#define AUXR2BOOSTVOL_N9DB              (2)
#define AUXR2BOOSTVOL_N6DB              (3)
#define AUXR2BOOSTVOL_N3DB              (4)
#define AUXR2BOOSTVOL_0DB               (5)
#define AUXR2BOOSTVOL_3DB               (6)
#define AUXR2BOOSTVOL_6DB               (7)

// R49 REG_OUTPUT
#define DACL2RMIX                       (1 << 6)
#define DACR2LMIX                       (1 << 5)
#define OUT4BOOST                       (1 << 4)
#define OUT3BOOST                       (1 << 3)
#define SPKBOOST                        (1 << 2)
#define TSDEN                           (1 << 1)
#define VROI                            (1)

// R50 REG_LEFT_MIXER
#define AUXLMIXVOL_POS                  (6)
#define AUXLMIXVOL_MASK                 (7)
#define AUXLMIXVOL_N15DB                (0)             // Default value
#define AUXLMIXVOL_N12DB                (1 << 6)
#define AUXLMIXVOL_N9DB                 (2 << 6)
#define AUXLMIXVOL_N6DB                 (3 << 6)
#define AUXLMIXVOL_N3DB                 (4 << 6)
#define AUXLMIXVOL_0DB                  (5 << 6)
#define AUXLMIXVOL_3DB                  (6 << 6)
#define AUXLMIXVOL_6DB                  (7 << 6)
#define AUXL2LMIX                       (1 << 5)
#define BYPLMIXVOL_POS                  (2)
#define BYPLMIXVOL_MASK                 (7)
#define BYPLMIXVOL_N15DB                (0)             // Default value
#define BYPLMIXVOL_N12DB                (1 << 2)
#define BYPLMIXVOL_N9DB                 (2 << 2)
#define BYPLMIXVOL_N6DB                 (3 << 2)
#define BYPLMIXVOL_N3DB                 (4 << 2)
#define BYPLMIXVOL_0DB                  (5 << 2)
#define BYPLMIXVOL_3DB                  (6 << 2)
#define BYPLMIXVOL_6DB                  (7 << 2)
#define BYPL2LMIX                       (1 << 1)
#define DACL2LMIX                       (1)

// R51 REG_RIGHT_MIXER
#define AUXRMIXVOL_POS                  (6)
#define AUXRMIXVOL_MASK                 (7)
#define AUXRMIXVOL_N15DB                (0)             // Default value
#define AUXRMIXVOL_N12DB                (1 << 6)
#define AUXRMIXVOL_N9DB                 (2 << 6)
#define AUXRMIXVOL_N6DB                 (3 << 6)
#define AUXRMIXVOL_N3DB                 (4 << 6)
#define AUXRMIXVOL_0DB                  (5 << 6)
#define AUXRMIXVOL_3DB                  (6 << 6)
#define AUXRMIXVOL_6DB                  (7 << 6)
#define AUXR2RMIX                       (1 << 5)
#define BYPRMIXVOL_POS                  (2)
#define BYPRMIXVOL_MASK                 (7)
#define BYPRMIXVOL_N15DB                (0)             // Default value
#define BYPRMIXVOL_N12DB                (1 << 2)
#define BYPRMIXVOL_N9DB                 (2 << 2)
#define BYPRMIXVOL_N6DB                 (3 << 2)
#define BYPRMIXVOL_N3DB                 (4 << 2)
#define BYPRMIXVOL_0DB                  (5 << 2)
#define BYPRMIXVOL_3DB                  (6 << 2)
#define BYPRMIXVOL_6DB                  (7 << 2)
#define BYPR2RMIX                       (1 << 1)
#define DACR2RMIX                       (1)

// R52 - R55 REG_LOUT1_VOL - REG_ROUT2_VOL
#define HPVU                            (1 << 8)
#define SPKVU                           (1 << 8)
#define LOUT1ZC                         (1 << 7)
#define LOUT1MUTE                       (1 << 6)
#define ROUT1ZC                         (1 << 7)
#define ROUT1MUTE                       (1 << 6)
#define LOUT2ZC                         (1 << 7)
#define LOUT2MUTE                       (1 << 6)
#define ROUT2ZC                         (1 << 7)
#define ROUT2MUTE                       (1 << 6)
#define VOL_POS                         (0)
#define VOL_MASK                        (63)

// R56 REG_OUT3_MIXER
#define OUT3MUTE                        (1 << 6)
#define OUT4_2OUT3                      (1 << 3)
#define BYPL2OUT3                       (1 << 2)
#define LMIX2OUT3                       (1 << 1)
#define LDAC2OUT3                       (1)

// R57 REG_OUT4_MIXER
#define OUT4MUTE                        (1 << 6)
#define HALFSIG                         (1 << 5)
#define LMIX2OUT4                       (1 << 4)
#define LDAC2OUT4                       (1 << 3)
#define BYPR2OUT4                       (1 << 2)
#define RMIX2OUT4                       (1 << 1)
#define RDAC2OUT4                       (1)

void WM8978_Init(void);
void WM8978_RegWrite(u16 Address, u16 Data);

#ifdef __cplusplus
}
#endif

#endif /* __WM8978_H                                                                                        */
